workspace/Pensoft/Altova/MapForce2013/MapForceExamples/TimeService/getCityTimeR

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:getCityTime xmlns:m="http://www.Nanonull.com/TimeService/">
			<m:city>Boston</m:city>
		</m:getCityTime>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
