workspace/Pensoft/Altova/MapForce2013/MapForceExamples/TimeServiceWsdl2/getServ

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:getServerCity xmlns:m="http://www.Nanonull.com/TimeService/"/>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
